app/views/booking/index.html.erb

  <p>
    <%= select_tag 'room_type',options_for_select(@room_types.pluck(:name),selected: params[:room_type])%>
---
SELECT `room_types`.`name` FROM `room_types`