app/controllers/booking_controller.rb

SELECT `room_types`.* FROM `room_types`
---
  def index
    @room_types = RoomType.all

SELECT `bookings`.`room_id` FROM `bookings` WHERE `bookings`.`room_id` IN (20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39) AND ((booking_from >= '2016-03-01 00:00:00.000000' and booking_to <= '2016-03-03 23:59:59.000000') or (booking_from > '2016-03-01 00:00:00.000000' and booking_to > '2016-03-03 23:59:59.000000' and booking_from < '2016-03-03 23:59:59.000000') or (booking_from < '2016-03-01 00:00:00.000000' and booking_to > '2016-03-01 00:00:00.000000'))
INSERT INTO `bookings` (`room_id`, `booking_from`, `booking_to`, `user_id`, `payment`, `created_at`, `updated_at`) VALUES (40, '2016-03-01 00:00:00', '2016-03-03 23:59:59', 1, 14000, '2016-03-29 05:33:21', '2016-03-29 05:33:21')
SELECT `room_types`.* FROM `room_types`
---
  def create
    available_roooms
    if @available_room_ids.present?
      @book = Booking.new(room_id: @available_room_ids.first,booking_from: @start_date,booking_to: @end_date, user_id: current_user.id, payment: ((@end_date - @start_date).to_i * @room_type.tariff) )
      if @book.save
        @room_types = RoomType.all